<?php

function num2string($num) {
    $ans = '';
    $digit = Array("หนึ่ง", "สอง", "สาม", "สี่", "ห้า", "หก", "เจ็ด", "แปด", "เก้า");
    $unit = Array("สิบ", "ร้อย", "พัน", "หมื่น", "แสน");

    if ($num == 0)
        return "บาทถ้วน";

    if (strpos($num, ".") == 0)
        $num .= ".00";

    $tmp = substr($num, 0, strpos($num, "."));
    while (strlen($tmp) > 6) {
        $cut = strlen($tmp) % 6;
        if ($cut == 0)
            $cut = 6;
        $data = substr($tmp, 0, $cut);
        for ($i = 0; $i < strlen($data) - 2; $i++) {
            if ($data[$i] == 0)
                continue;

            $ans .= $digit[$data[$i] - 1] . $unit[strlen($data) - $i - 2];
        }
        $ans .= num2string_2digit(substr($data, strlen($data) - 2)) . "ล้าน";
        $tmp = substr($tmp, $cut);
    }

    for ($i = 0; $i < strlen($tmp) - 2; $i++) {
        if ($tmp[$i] == 0)
            continue;

        $ans .= $digit[$tmp[$i] - 1] . $unit[strlen($tmp) - $i - 2];
    }

    $ans .= num2string_2digit(substr($tmp, strlen($tmp) - 2)) . "บาท";

    $tmp = substr($num, strpos($num, ".") + 1);
    if (substr($tmp, 0, 2) == "00")
        return $ans . "ถ้วน";

    return $ans . num2string_2digit($tmp) . "สตางค์";
}

function num2string_2digit($num) {
    $digit = Array("", "หนึ่ง", "สอง", "สาม", "สี่", "ห้า", "หก", "เจ็ด", "แปด", "เก้า");

    $ans = "";
    $num = sprintf("%d", $num);

    if (strlen($num) == 1)
        return $digit[$num];

    if ($num[0] == 2)
        $ans .= "ยี่";
    else if ($num[0] > 2)
        $ans .= $digit[$num[0]];

    if ($num[0] > 0)
        $ans .= "สิบ";

    if ($num[1] > 1)
        $ans .= $digit[$num[1]];
    else if ($num[1] == 1)
        $ans .= "เอ็ด";

    return $ans;
}
?>
<!DOCTYPE html>
<!--
To change this license header, choose License Headers in Project Properties.
To change this template file, choose Tools | Templates
and open the template in the editor.
-->
<html>
    <head>
        <meta charset="UTF-8">
        <title>สัญญา #{{ $contracts->contract }}</title>
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />

        <link rel="stylesheet" type="text/css" href="{{ asset('bootstrap/css/bootstrap.min.css') }}" />
        <link rel="stylesheet" type="text/css" href="{{ asset('font-awesome/css/font-awesome.min.css') }}" />

        <script type="text/javascript" src="{{ asset('js/jquery-1.10.2.min.js') }}"></script>
        <script type="text/javascript" src="{{ asset('bootstrap/js/bootstrap.min.js') }}"></script>
        <link href="https://fonts.googleapis.com/css?family=Bai+Jamjuree:400,700" rel="stylesheet"> 
        <style>
            html,body{
                font-family: 'Bai Jamjuree', sans-serif;
            }
        </style>
    </head>
    <body>
        <div class="page-header">
            <img src="{{ asset('images/'.$setting->logo) }}" width="120" height="120"><h1>{{ $setting->name_en }}({{ $setting->name_th }}) {{ $setting->iddorm }} <br/><small>{{ $setting->address }} โทร {{ $setting->phone }} อีเมลล์ {{ $setting->email }}</small></h1>
        </div>

        <div class="row">
            <div class="col-xs-12">
                <div class="text-center">
                    <b><h2>หนังสือสัญญาเช่าห้องพัก</h2></b>
                </div>
                @if($contracts->status == 1)
                <div class="text-center">
                    <b><h2><font color="blue">หนังสือสัญญาฉบับนี้ได้ย้ายห้อง/ต่อสัญญาแล้ว เมื่อ {{ $contracts->cancel }}</font></h2></b>
                </div>
                @endif
                @if($contracts->status == 2)
                <div class="text-center">
                    <b><h2><font color="red">หนังสือสัญญาฉบับนี้ถูกยกเลิกแล้ว เมื่อ {{ $contracts->cancel }}</font></h2></b>
                </div>
                @endif
                <div class="text-right">
                    <b><h3>เลขที่ {{ $contracts->contract }}</h3></b>
                </div>
                <div class="text-right">
                    <h4>วันที่ {{ date_format($contracts->created_at,'Y-m-d') }}</h4>
                </div>
                <hr>
            </div>
        </div>
        <div class="row">
            <div class="col-md-12">
                <div class="panel">
                    <p>
                        ข้าพเจ้า <b>{{ $contracts->user->name }}</b> บัตรประจำตัวประชาชนเลขที่ <b>{{ $contracts->profiles->idcard }}</b>
                        อยู่บ้านเลขที่ <b>{{ $contracts->profiles->address }}</b> ประกอบอาชีพ <b>{{ $contracts->profiles->career }}</b>
                        เบอร์โทรที่สามารถติดต่อต่อได้ <b>{{ $contracts->profiles->mobile }}</b> ซึ่ง ณ ที่นี้เรียกว่า <b>"ผู้เช่า"</b> ได้ทำสัญญาฉบับนี้ไว้กับ
                        <b>{{ $setting->contract }}</b> ซึ่งมีตำแหน่ง <b>ผู้จัดการ</b> ที่นี้เรียกว่า <b>"ผู้ให้เช่า"</b> ดังรายละเอียดดังต่อไปนี้
                    </p>
                    <p>
                        1. ผู้เช่าได้ตกลงเช่าห้องพักหมายเลข  <b>{{ $rooms->name }}</b> ชั้น  <b>{{ $rooms->floor }}</b>  ของอาคารพักอาศัย เดอะพราว
                        นับตั้งแต่ <b>{{ $contracts->start }}</b> ถึง <b>{{ $contracts->end }}</b> ในอัตราเช่าเดือนละ <b>{{ $rooms->price }}</b> บาท 
                        (<b>
                            <?php
                            echo num2string($rooms->price);
                            ?>
                        </b>) เป็นเวลา <b>{{ $contracts->term }}</b> เดือน
                    </p>
                    <p>
                        2. ผู้เช่าได้จ่ายเงินมัดจำล่วงหน้าจำนวน <b>{{ $rooms->price }}</b> บาท (<b>
                            <?php
                            echo num2string($rooms->price);
                            ?>
                        </b>) เท่ากับอัตราเช่า 1 เดือนของค่าเช่าในวันทำสัญญานี้ ให้ถือเป็นเงินประกันความเสียหายต่างๆ ที่อาจเกิดขึ้นในระหว่างอยู่อาศัยหรือเกิดจากสาเหตุในการผิดสัญญาต่างๆ ตามมูลค่าที่เสียหายของทรัพย์สินนั้นๆ
                    </p>
                    <p>
                        3. กรณีผู้เช่ายังวางเงินประกันตามสัญญาข้อที่ 2 ไม่ครบตามจำนวนและมีการบอกเลิกการเช่าเสียก่อน เงินจำนวนที่วางไว้แล้วนั้น ทางผู้เช่าจะยึดเป็นค่าเปิดห้องค่าเสียหายของห้องเต็มจำนวนที่ได้วางไว้ จะไม่นำมาหักกับค่าใช้จ่ายทั้งหมดที่เกิดขึ้นเมื่อผู้เช่าย้ายออก ให้ถือว่าการแจ้งย้ายออกในขณะนั้นเป็นอันสิ้นสุดแห่งสัญญาเช่า ผู้เช่าจะไม่มีสิทธิ์นำเงินส่วนที่ค้างประกันมาชำระให้เต็มจำนวนเพื่อใช้โอกาสในการนำเงินประกันที่วางไว้มาหักค่าใช้จ่ายที่เกิดขึ้นขณะที่ผู้เช่าย้ายออกได้อีก ถึงแม้ว่าผู้เช่าจะแจ้งล่วงหน้าก่อนย้ายออก เป็นเวลา 1 เดือนแล้วก็ตาม ท่านก็ยังคงจะต้องจ่ายค่าใช้จ่ายที่เกิดขึ้นทั้งหมดดังนี้ คือ ค่าเช่าห้อง ค่าไฟฟ้า ค่าน้ำประปา ค่าโทรศัพท์ และค่าเสียหายอื่นๆ ในกรณีทรัพย์สินภายในห้องเสียหายมากกว่าวงเงินที่ได้วางประกันไว้แล้ว
                    </p>
                    <p>
                        4. กรณีที่มีการย้ายออกกระทันหันโดยไม่มีการแจ้ง ทางผู้ให้เช่าจะคิดค่าห้องเพิ่มครึ่งเดือน
                    </p>
                    <p>
                        5. เมื่อผู้เช่าเข้าพักในห้องเช่าแล้ว หากภายในห้องพักมีสิ่งใดเสียหาย ต้องรีบแจ้งให้ผู้ให้เช่าทราบเพื่อทำการแก้ไขภายใน 5 วัน มิฉะนั้นจะถือเสมือนว่าอุปกรณ์ภายในห้องพักทั้งหมดเรียบร้อยทุกประการ 
                    </p>
                    <p>
                        6. ผู้เช่าสัญญาว่าจะไม่ทำการเปลี่ยนแปลงสภาพห้องพักจากเดิมที่เป็นอยู่ หรือจะไม่ทำการใดๆ อันจะทำให้สภาพห้องพักชำรุดเสียหาย เช่น ติดตั้งอุปกรณ์ห้องพัก, ตอกตะปู, ติดรูปภาพ, ทาสี ฯลฯ ตลอดจนสัญญาว่าจะรักษาสภาพห้องพักให้มีสภาพคงเดิมเสมอไป (ตอกตะปู ปรับรูละ 100 บาท ติดกระดาษกาวจะดูตามความมากน้อยที่ติดและเหมารวมค่าเอาออก)
                    </p>
                    <p>
                        7. สิ่งติดตั้ง, ต่อเติม (ที่ได้รับอนุญาตแล้ว) เมื่อมีการบอกเลิกสัญญาเช่า ทางผู้เช่ามีสิทธิ์รื้อถอนได้ (นอกเสียจากสิ่งที่ติดตั้งบางอย่างที่ทางผู้ให้เช่าเห็นว่าหากรื้อถอนออกไปจะนำความเสียหายต่อสภาพอาคาร, ที่พัก ผู้ให้เช่าก็จะไม่อนุญาตให้รื้อออกไป) แต่ทั้งนี้หากการรื้อถอนก่อให้เกิดความชำรุดเสียหายต่อตัวอาคาร/สิ่งก่อสร้างเดิม ผู้ให้เช่ามีสิทธิ์เรียกร้องค่าเสียหายที่เกิดขึ้นกับผู้เช่า โดยจะหักจากเงินประกันตามสัญญาข้อที่ 2 ที่วางไว้ แต่ถ้าหากสิ่งติดตั้ง, ต่อเติมดังกล่าวไม่ว่าจะให้เอาออกได้หรือไม่ได้ ผู้เช่าไม่นำออกไป ทางผู้เช่าก็ไม่มีสิทธิ์มาเรียกร้องค่าทรัพย์สินนั้นๆ จากผู้ให้เช่า
                    </p>
                    <p>
                        8. สิทธิ์ในการเช่าพักตามสัญญานั้น เป็นสิทธิ์เฉพาะตัวผู้เช่า และไม่เป็นทรัพย์สินที่จะโอนกันโดยทางมรดกหรือทางใด ๆ เว้นแต่จะได้รับความยินยอมจากผู้ให้เช่าเป็นลายลักษณ์อักษร
                    </p>
                    <p>
                        9. ฝาท่อน้ำทิ้งได้มีการติดตั้งให้ติดไว้กับพื้นห้องน้ำ เพื่อป้องกันมิให้ผู้เช่าที่มักง่ายบางรายทิ้งเศษอาหาร ซึ่งจะมีผลทำให้ท่อน้ำอุดตัน หากวันที่ท่านย้ายออกได้ตรวจพบว่าฝาท่อน้ำนั้นหลุดออก หรือเสียหายอันเกิดจากการกระทำของผู้เช่า ถึงแม้ว่าผู้เช่าจะอ้างว่าหลุดอยู่ก่อนแล้วก็ตาม เพราะเมื่อท่านอ่านสัญญาและลงลายมือชื่อ ให้ถือว่าท่านยอมรับผิดชอบในสภาพห้องพักที่เกิดขึ้น นอกเสียจากมีการบอกกล่าวแก่ผู้เช่าตั้งแต่ก่อนลงลายมือชื่อ ดังนั้นหากเกิดชำรุดตามที่ได้กล่าวมาแล้ว วันที่ท่านย้ายออกทางผู้ให้เช่าจะหักเงินมัดจำตามสัญญาข้อที่ 2 เป็นจำนวน 500 บาท
                    </p>
                    <p>
                        10. กรณีมีเหตุจำเป็นในการผิดนัดการชำระค่าเช่า จะอนุญาตให้เพียง 7 วันเท่านั้น หากเกินกว่านี้จะคิดค่าปรับวันละ 100 บาท จนถึงวันที่ 15 ของเดือนหากท่านยังไม่นำค่าเช่าพักมาชำระ ให้ถือว่าสัญญาเช่าเป็นอันสิ้นสุดลง ให้ผู้เช่าย้ายทรัพย์สินออกจากสถานที่เช่าภายใน 7 วันและให้คิดค่าเช่าในเดือนที่อยู่ล่วงหน้ามาเต็มเดือนพร้อมกับค่าปรับตามจำนวนวันคือ ตั้งแต่วันที่ 7 จนถึงวันที่ย้ายออก
                    </p>
                    <p>
                        11. ในกรณีผู้เช่าทิ้งห้องในร้างไว้เกิน  1  เดือนโดยทางผู้ให้เช่าเอง  ก็ไม่ได้รับการติดต่อจากผู้เช่าเลยถึงการรับผิดชอบในค่าเช่าห้องพัก  (กรณีนี้รวมถึงเจ้าของห้องไม่รับผิดชอบในค่าเช่าด้วย คือไม่สามารถชำระค่าเช่าได้เมื่อถึงวันที่ 15) ผู้ให้เช่ามีสิทธิ์นำทรัพย์สินของผู้เช่าออกจากห้องเพื่อเปิดห้องให้บุคคลอื่นเช่าต่อไปได้โดยไม่มีความผิดตามกฎหมายแต่ประการใดเพราะให้ถือว่าลายมือชื่อของผู้เช่า ท้ายสัญญา คือการอนุญาตของผู้เช่าตามกฎหมาย และทางผู้เช่าก็ไม่มีสิทธิ์มาเรียกร้องค่าเสียหายในทรัพย์สินใด ๆ ที่นำออกมาหรือทรัพย์สินใด ๆ ที่ผู้เช่าพูดแต่เพียงฝ่ายเดียวว่าสูญหายไปและภายใน 15 วันหลังจากนำทรัพย์สินออกจากห้องทางผู้เช่าคงไม่ติดต่อกลับมาเพื่อชำระหนี้สินที่คงค้าง ผู้ให้เช่ามีสิทธิ์นำทรัพย์สินออกจำหน่าย หรือทิ้งได้โดยไม่มีความผิดแต่ประการใด ผู้เช่าไม่มีสิทธิ์ที่จะมาเรียกร้องค่าทรัพย์สินในภายหลัง
                    </p>
                    <p>
                        12. ในการบอกเลิกสัญญาเช่า ผู้เช่าจะต้องแจ้งให้ผู้เช่าทราบอย่างน้อยเป็นเวลา 1 เดือนหากน้อยกว่านี้ ทางผู้ให้เช่าจะไม่คืนเงินประกันส่วนที่เหลือให้ และเมื่อมีการบอกเลิกสัญญาเช่าแล้ว เมื่อถึงกำหนดผู้เช่าไม่ยอมออกจากสถานที่เช่า ผู้เช่าจะต้องจ่ายค่าเสียหายให้แก่ผู้ให้เช่าเป็นจำนวนเงิน 500 บาท เพื่อต่อสัญญา
                    </p>
                    <p>
                        13. และในวันที่ผู้เช่าย้ายออก ทางผู้ให้เช่าจะเข้าตรวจสภาพสีและอุปกรณ์ของห้องพักทั้งหมด โดยจะคิดสภาพความทรุดโทรมของสี ส่วนอุปกรณ์ห้องพักก็จะคิดตามความเสียหาย (โดยจะคิดตามจำนวนสีที่ต้องใช้ทา+ค่าแรงในการทา) ซึ่งราคาสีและอุปกรณ์ที่เสียหายจะคิดตามราคาปัจจุบัน โดยสิทธิ์ในการซ่อมแซมให้เป็นสิทธิ์ของผู้ให้เช่าเท่านั้น 
                    </p>
                    <p>
                        14. หากผู้เช่าเข้าพักในสถานที่เช่าในวันที่ 1-3 ทางผู้เช่าจะคิดค่าเช่าเต็มเดือน หากตั้งแต่วันที่ 4 เป็นต้นไป ก็จะคิดตั้งแต่วันที่ท่านเข้าพักอาศัยจะถึงสิ้นเดือน เช่นเดียวกันเมื่อมีการย้ายออก หากท่านย้ายออกตั้งแต่วันที่ 1-2 ของเดือนจะคิดค่าเช่าเพิ่มอีก 2 วัน ตั้งแต่วันที่ 3 เป็นต้นไปจะคิดค่าเช่าเพิ่มเป็น 1 สัปดาห์ ย้ายออกในวันที่ 7 เป็นต้นไปจะคิดค่าเช่าเพิ่มเป็นครึ่งเดือน และย้ายออกในวันที่ 15 เป็นต้นไปจะคิดค่าเช่าเต็มเดือน ซึ่งกรณีเดียวกันหากมีการแจ้งย้ายออกในวันที่ 15 หรือวันใดที่ไม่ตรงกับสิ้นเดือน การย้ายออกจะต้องกระทำในวันสิ้นเดือนของเดือนถัดไป เพราะถึงท่านจะย้ายออกในวันซึ่งตรงกับที่ท่านแจ้งของเดือนถัดไป ท่านก็ต้องชำระค่าห้องของเดือนถัดไปที่ท่านย้ายออกเต็มเดือน
                    </p>
                    <p>
                        15. ผู้เช่าสัญญาว่าจะปฏิบัติตามกฎระเบียบของที่พักในท้ายสัญญานี้อย่างเคร่งครัด
                    </p>
                    <p>
                        16. ผู้เช่ายินดีให้ผู้ให้เช่าหักค่าเสียหายตามสัญญาข้อที่ 2 ได้โดยไม่มีข้อแม้แต่ประการใดและผู้ให้เช่ามีสิทธิ์ขอเข้าตรวจสภาพห้องพักและอุปกรณ์ห้องพักได้ทุกเวลา
                    </p>
                    <p>
                        17. ผู้ให้เช่ามีสิทธิ์บอกเลิกสัญญาเช่านี้ได้ทันที หากผู้เช่าผิดสัญญาข้อหนึ่งข้อใดในสัญญาฉบับนี้ ตลอดจนไม่ปฏิบัติตามกฎระเบียบในท้ายสัญญานี้ด้วย และเมื่อมีการบอกเลิกสัญญาเช่าแล้ว ผู้เช่าจะต้องย้ายออกจากสถานที่เช่าภายใน 7 วัน นับจากวันที่มีการบอกเลิกสัญญาเช่า
                    </p>
                    <p>
                        18. เมื่อผู้ให้เช่ามีเหตุจำเป็นจะต้องยกเลิกการเช่า ผู้ให้เช่าจะต้องแจ้งให้ผู้เช่าทราบล่วงหน้าเป็นเวลา 1 เดือน และผู้เช่าจะต้องย้ายออกจากสถานที่เช่าภายใน 7 วันนับจากที่มีการแจ้งโดยไม่มีข้อแม้แต่ประการใด
                    </p>
                    <p>
                        สัญญาฉบับนี้ให้ถือเป็นหลักฐานการทำสัญญาระหว่าง <b>"ผู้เช่า"</b> และ <b>"ผู้ให้เช่า"</b> โดยให้ถือว่ามีผลบังคับใช้เป็นหลักฐานตามกฎหมายได้ในกรณีฝ่ายหนึ่งฝ่ายใดผิดสัญญา สัญญาฉบับนี้ได้ทำขึ้นจำนวน 2 ฉบับ โดยมีข้อความตรงกันและทั้งสองฝ่ายได้อ่านเป็นที่เข้าใจดีแล้ว จึงได้ลงลายมือชื่อไว้เป็นหลักฐาน
                    </p>
                </div>
            </div>
        </div>
        <div class="row">
            <div class="col-md-12 text-right">
                ลงชื่อ&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;ผู้เช่า 
            </div>
        </div>
        <div class="row">
            <div class="col-md-12 text-right">
                {{ $contracts->user->name }}&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;
            </div>
        </div>
        <br/>
        <br/>
        <div class="row">
            <div class="col-md-12 text-right">
                ลงชื่อ&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;ผู้ให้เช่า 
            </div>
        </div>
        <div class="row">
            <div class="col-md-12 text-right">
                {{ $setting->contract }}&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;
            </div>
        </div>


        <div class="row">
            <div class="col-md-12 text-left">
                ลงชื่อ&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;พยาน
            </div>
        </div>
        <br/>
        <br/>
        <div class="row">
            <div class="col-md-12 text-left">
                ลงชื่อ&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;พยาน 
            </div>
        </div>
        <br/>
    <center>
        <?php echo '<img src="data:image/png;base64,' . DNS1D::getBarcodePNG($contracts->contract, "C128", 3, 33) . '"/>'; ?>
    </center>
    <br/>

    <style>
        .height {
            min-height: 200px;
        }

        .icon {
            font-size: 47px;
            color: #5CB85C;
        }

        .iconbig {
            font-size: 77px;
            color: #5CB85C;
        }

        .table > tbody > tr > .emptyrow {
            border-top: none;
        }

        .table > thead > tr > .emptyrow {
            border-bottom: none;
        }

        .table > tbody > tr > .highrow {
            border-top: 3px solid;
        }
    </style>
</body>
</html>
